<!-- dflook/terraform-github-actions {"workspace":"default","backend":"f0b1527923d0445c56732209b6c15c1797bfd426dd65ac37151c5227bd9bdb5b","backend_type":"local","label":"resource-group-sandbox"} -->
Terraform plan for __resource-group-sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "sandbox-rg-test"
      + tags     = (known after apply)
    }

  # time_static.activation_date will be created
  + resource "time_static" "activation_date" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "foo" but a value was found
in file "/tmp/variables.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:white_check_mark: Plan applied in [az-oidc-test #14](https://github.com/stevengonsalvez/cloud-cicd-exploration/actions/runs/3204363988)